[
  {
    "date": "2024",
    "tag": ["WordPress"],
    "title": "Trackloc",
    "subtitle": "Entreprise de vente / location de matériels spécialisés pour chantier ",
    "cover": "/assets/images/projects/thumbnail-trackloc.webp",
    "link": "https://tracklocservices.fr/",
    "link-github": "",
    "description": "Projet réalisé durant mon apprentissage dans l'Agence Séquane. Les blocs de contenu ont été codés selon la maquette graphique validée par le client. Ils seront ensuite réutilisables facilement pour modifier des pages existantes ou en créer de nouvelles. Le client peut facilement mettre à jour les informations grâce à un back-office personnalisé. Le site est bien-sûr Responsive et optimisé pour le référencement.",
    "type": "sequane"
  },
  {
    "date": "2024",
    "tag": ["WordPress"],
    "title": "ENILÉA",
    "subtitle": "École Nationale de l’Innovation des Laboratoires, de l’Eau et de l’Alimentation",
    "cover": "/assets/images/projects/thumbnail-enilea.webp",
    "link": "https://enilea.fr/",
    "link-github": "",
    "description": "Projet réalisé durant mon apprentissage dans l'Agence Séquane. Les blocs de contenu ont été codés selon la maquette graphique validée par le client. Ils seront ensuite réutilisables facilement pour modifier des pages existantes ou en créer de nouvelles. Un site ambitieux par le nombre de blocs différents à développer, la quantité de contenu à intégrer, et le niveau de personnalisation du back-office pour rendre l'administration du contenu simple et intuitive.",
    "type": "sequane"
  },
  {
    "date": "2024",
    "tag": ["WordPress", "WooCommerce"],
    "title": "Préval Haut-Doubs",
    "subtitle": "Établissement en charge de la Prévention et de la Valorisation des déchets ménagers",
    "cover": "/assets/images/projects/thumbnail-preval.webp",
    "link": "https://preval.fr/",
    "link-github": "",
    "description": "Projet réalisé durant mon apprentissage dans l'Agence Séquane. Les blocs de contenu ont été codés selon la maquette graphique validée par le client. Ils seront ensuite réutilisables facilement pour modifier des pages existantes ou en créer de nouvelles. Un projet caractérisé par une grande quantité de contenu à (ré)intégrer car il s'agissait d'une refonte. Un espace boutique a été ajouté pour la vente de produits dérivés (compost, composteurs, etc.) ainsi qu'un système click-and-collect.",
    "type": "sequane"
  },
  {
    "date": "2024",
    "tag": ["WordPress"],
    "title": "La République du Saugeais",
    "subtitle": "Une république insolite où l’histoire et la convivialité se rencontrent",
    "cover": "/assets/images/projects/thumbnail-saugeais.webp",
    "link": "https://republique-saugeais.fr/",
    "link-github": "",
    "description": "Projet réalisé durant mon apprentissage dans l'Agence Séquane. Les blocs de contenu ont été codés selon la maquette graphique validée par le client. Ils seront ensuite réutilisables facilement partout sur le site. Plusieurs types de Galeries d'images sont à disposition (Masonry, Miniatures, Carousel). Une attention particulière a été portée sur le back-office : la mise à jour / création de nouveaux contenus est intuitive et rapide pour l'administratrice du site. N'ayant aucune connaissance de WordPress, une formation lui a été proposée. Le site est bien-sûr Responsive et optimisé pour le référencement.",
    "type": "sequane"
  },
  {
    "date": "2024",
    "tag": ["WordPress"],
    "title": "Agence Séquane",
    "subtitle": "Agence de communication & marketing à Pontarlier",
    "cover": "/assets/images/projects/thumbnail-sequane.webp",
    "link": "https://www.sequane.fr/",
    "link-github": "",
    "description": "Projet réalisé durant mon apprentissage dans l'Agence Séquane. Il s'agit de la refonte du site de l'agence qui présente ses services, ses réalisations, son équipe, etc. L'objectif était d'utiliser WordPress pour gérer le contenu et d'apporter de la modernité tout en gardant le Design précédent (noir&blanc). L'arborescence a été repensée pour une meilleure ergonomie et un meilleur référencement.",
    "type": "sequane"
  },
  {
    "date": "2024",
    "tag": ["WordPress"],
    "title": "Formes-toi au bois",
    "subtitle": "Présentation de la formation Bac Pro Technicien Scierie",
    "cover": "/assets/images/projects/thumbnail-formestoiaubois.webp",
    "link": "https://www.forme-toi-au-bois.fr/",
    "link-github": "",
    "description": "Projet réalisé durant mon apprentissage dans l'Agence Séquane. Un site 'seulement' one-page mais intéressant du fait des animations variées dont certaines étaient assez 'tricky' à réaliser.",
    "type": "sequane"
  },
  {
    "date": "2024",
    "tag": ["WordPress", "Elementor Pro"],
    "title": "O-DOO",
    "subtitle": "Site du magazine Commerçants et Artisans du Grand Pontarlier",
    "cover": "/assets/images/projects/thumbnail-odoo.webp",
    "link": "https://o-doo.fr/",
    "link-github": "",
    "description": "Projet réalisé durant mon apprentissage dans l'Agence Séquane. Un site assez classique, permettant de consulter le dernier numéro du magazine O-doo (sous la forme d'un Calaméo), visionner quelques vidéos d'annonceurs et prendre contact. Spécificité : un changement de Design régulier (tous les 6 mois) pour s'adapter à celui du nouveau numéro.",
    "type": "sequane"
  },
  {
    "date": "2024 - Développement en cours",
    "tag": ["Symfony", "MySQL", "Bootstrap"],
    "title": "RéservaClasse",
    "subtitle": "Gestion de créneaux horaires pour les écoles",
    "cover": "/assets/images/projects/thumbnail-reservaclasse-mini.webp",
    "link": "",
    "link-github": "https://github.com/Alex-Web-Github/ReservaClasse",
    "description": "Application web pour la gestion de créneaux horaires pour les écoles. Réalisé avec Symfony 7.1, Bootstrap 5, Twig, Doctrine, MySQL. L'application permettra à un enseignant de créer des créneaux horaires (durée, intervalles) pour des RdV parents-enseignant. Puis chaque parent pourra réserver un créneau (parmi ceux restants) pour rencontrer l'enseignant de son enfant. L'enseignant pourra voir les RdV réservés et les annuler si besoin.",
    "type": "personnal"
  },
  {
    "date": "2024",
    "tag": ["PHP", "MySQL", "Bootstrap"],
    "title": "MoneyBall: Play, Bet and Win",
    "subtitle": "Jeu de pari sportif en ligne",
    "cover": "/assets/images/projects/thumbnail-moneyball-mini.webp",
    "link": "",
    "link-github": "https://github.com/Alex-Web-Github/ECF-SuperBowl",
    "description": "Projet réalisé dans le cadre de ma formation. Application PHP 'hybride' car j'ai utilisé certains composants de Symfony mais pas son architecture complète. J'ai appris à gérer les formats date/heure, l'envoi de mails avec authentification et la gestion de formulaires pour interagir avec la BDD. Sur son Dashboard, l'Administrateur crée des équipes (choix de 11 joueurs parmi une liste prédéfinie), crée des matchs (nom des 2 équipes, date, heures). Les visiteurs peuvent uniquement consulter les matchs passés, en cours, et à venir. Pour jouer, il devra s'inscrire au préalable (envoi d'e-mail de validation). Une fois inscrit, l'Utilisateur pourra se connecter, parier sur un match, consulter ses paris, voir les résultats des matchs, voir son solde, etc. Le Speaker pourra commenter les matchs en direct et déterminer le score final.",
    "type": "student"
  },
  {
    "date": "2024",
    "tag": ["PHP", "API", "JavaScript"],
    "title": "My CryptoApp",
    "subtitle": "Suivi des cours de vos crypto. favorites",
    "cover": "/assets/images/projects/thumbnail-cryptoapp-mini.webp",
    "link": "",
    "link-github": "https://github.com/Alex-Web-Github/CryptoApp",
    "description": "Projet réalisé dans le cadre de ma formation. J'ai appris à utiliser une API (celle de 'cryptocompare.com') pour récupérer les données des crypto. en format JSON. Je me suis servi de la bibliothèque 'ChartJS' pour les diagrammes. L'Utilisateur peut s'inscrire, se connecter, modifier son profil, ajouter des cryptos à sa liste de favoris (sans rechargement de la page), voir les cours de ses crypto, la variation sur 24h, tendance sur les 24 dernières heures etc.",
    "type": "student"
  },
  {
    "date": "2022",
    "tag": ["WordPress"],
    "title": "C.D.S. 25",
    "subtitle": "Comité Départemental de Spéléologie du Doubs",
    "cover": "/assets/images/projects/thumbnail-CDS25-mini.webp",
    "link": "https://www.speleo-doubs.com/",
    "link-github": "",
    "description": "Site associatif réalisé avec le thème GeneratePress. Design personnalisé avec des blocs Gutenberg et du CSS custom. Le site est administré par plusieurs personnes, chacune ayant un rôle spécifique.",
    "type": "personnal"
  },
  {
    "date": "2021",
    "tag": ["WordPress"],
    "title": "DG Soudure Création",
    "subtitle": "Artisan métallier près Besançon",
    "cover": "/assets/images/projects/thumbnail-dgsoudure-mini-1.webp",
    "link": "https://dgsoudure.fr",
    "link-github": "",
    "description": "Site présentant les différentes prestations de cet artisan. Je l'ai réalisé avec le thème GeneratePress de WordPress et le constructeur de page Elementor. Le site est administré par le client, qui a été formé à l'utilisation de WordPress.",
    "type": "personnal"
  },
  {
    "date": "2023",
    "tag": ["PHP", "Bootstrap", "SASS"],
    "title": "Restaurant Quai Antique",
    "subtitle": "Site vitrine, contenu administrable et réservation en ligne",
    "cover": "/assets/images/projects/thumbnail-quaiantique-mini.webp",
    "link": "http://sc4foal9574.universe.wf/quai_antique/",
    "link-github": "https://github.com/Alex-Web-Github/Restaurant_QuaiAntique",
    "description": "Site web pour un restaurant savoyard fictif. Le site est codé en PHP / MySQL et Bootstrap 5 / Librairie AOS / SASS. Un back-office permet de gérer les plats, les réservations, le carousel, les horaires, etc. Possibilité de voir le nombre de places restantes selon la date et l'heure d'arrivée sans rechargement de la page. Un utilisateur régulier peut s'enregistrer et se connecter pour réserver plus rapidement (prise en compte de son profil: nb de couverts, allergies notamment).",
    "type": "student"
  },
  {
    "date": "2023",
    "tag": ["WordPress", "Bootstrap"],
    "title": "Charles Cantin",
    "subtitle": "Portofolio d'un photographe Freelance",
    "cover": "/assets/images/projects/thumbnail-charles-cantin-mini.webp",
    "link": "http://sc4foal9574.universe.wf/charles-cantin/",
    "description": "Ce site web est un Portofolio fictif présentant le travail du photographe Charles Cantin. Pour mon premier thème WP, je suis parti d'un 'boilerplate' de thème WordPress pour gagner du temps. J'ai ensuite codé le Design Responsive du site (HTML, CSS, JS,Bootstrap 5) conformément à ma maquette (réalisée sous Figma).",
    "link-github": "https://github.com/Alex-Web-Github/portofolio_charles-cantin",
    "type": "student"
  },
  {
    "date": "2022",
    "tag": ["JavaScript", "BulmaCSS"],
    "title": "Roll Dice",
    "subtitle": "Un jeu de dé pour jouer dans votre navigateur",
    "cover": "/assets/images/projects/thumbnail-rolldice-mini.webp",
    "link": "https://alex-web-github.github.io/Jeu-RollDice-JS/",
    "link-github": "https://github.com/Alex-Web-Github/Jeu-RollDice-JS",
    "description": "Mon premier code en JavaScript (et utilisation d'un framework alternatif : BulmaCSS), réalisé dans le cadre de ma formation. Déroulement du jeu : un point rouge (aléatoire) désigne qui débute la partie (Player 1 ou 2). Ici, l'utilisateur lance un dé (avec 'Roll Dice') puis le résultat s'affiche dans 'Current'. Il peut choisir de rejouer (dans ce cas les chiffres s'additionnent temporairement) ou de garder le score (avec 'Hold', dans ce cas le score s'affiche en haut et c'est à l'autre joueur de lancer le dé). Attention : si un '1' est obtenu, le tour est perdu et le score est remis à zéro.",
    "type": "student"
  },
  {
    "date": "Refonte en 2020",
    "tag": ["WordPress"],
    "title": "SportsNatureÉvasion",
    "subtitle": "Mon activité de Guide / Éducateur sportif",
    "cover": "/assets/images/projects/thumbnail-sportsnatureevasion-mini.webp",
    "link": "https://www.sportsnatureevasion.com",
    "link-github": "",
    "description": "Site web réalisé avec le thème GeneratePress de WordPress. Design personnalisé avec Gutenberg et du CSS custom. Le site est administré par moi-même. Il présente mes différentes activités de guide / éducateur sportif. Il est en constante évolution, avec l'ajout de nouvelles fonctionnalités et l'amélioration de l'ergonomie.",
    "type": "personnal"
  },
  {
    "date": "2022",
    "tag": ["Webdesign", "Figma"],
    "title": "ClipBoard",
    "subtitle": "Maquette sous Figma d'une application web fictive (desktop/mobile)",
    "cover": "/assets/images/projects/thumbnail-clipboard-mini.webp",
    "link": "/assets/images/Clipboard-Design_compressed.pdf",
    "link-github": "",
    "description": "Maquette d'une application web fictive (desktop et mobile) réalisée sous Figma. L'objectif était de travailler le design d'une application web en respectant les principes de l'UI/UX Design. J'ai réalisé ce projet dans le cadre de ma formation.",
    "type": "student"
  }
]
